app/Views/page/CalculationProcess/index.php

                            <th>Alternative</th>
                            <?php
                            $kriteriaModel = new \App\Models\CriteriaModel();
                            $kriteria = $kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

                            <th>Alternative</th>
                            <?php
                            $kriteriaModel = new \App\Models\CriteriaModel();
                            $kriteria = $kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

                                <th>Alternative</th>
                                <?php
                                $kriteriaModel = new \App\Models\CriteriaModel();
                                $kriteria = $kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

                            <th>Alternative</th>
                            <?php
                            $kriteriaModel = new \App\Models\CriteriaModel();
                            $kriteria = $kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`

                            <th>Alternative</th>
                            <?php
                            $kriteriaModel = new \App\Models\CriteriaModel();
                            $kriteria = $kriteriaModel->findAll();
---
SELECT *
FROM `kriteria`