app/Controllers/CalculationProcess.php

    public function index()
    {
        $alternatif = $this->alternatifModel->findAll();
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `alternatif`
SELECT *
FROM `kriteria`