app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `alternatif`
SELECT COUNT(*) AS `numrows` FROM `kriteria`
SELECT COUNT(*) AS `numrows` FROM `user`
---
    public function index()
    {
        // Mengambil jumlah data dari masing-masing model
        $jumlahAlternatif = $this->alternatifModel->countAll();
        $jumlahKriteria = $this->kriteriaModel->countAll();
        $jumlahPenilaian = $this->penialianModel->countAll();
        $jumlahUserData = $this->userDataModel->countAll();