app/Controllers/DataAssessment.php

    public function addData()
    {
        $alternatif = $this->alternatifModel->findAll();
        $kriteria = $this->kriteriaModel->findAll();
---
SELECT *
FROM `alternatif`
SELECT *
FROM `kriteria`