app/Controllers/DataCriteria.php

SELECT *
FROM `kriteria`
---
    public function index()
    {
        $DataTable = $this->kriteriaModel->findAll();