app/Controllers/History.php

    public function index()
    {
        // Mengambil semua data log
        $logs = $this->ActivityLog->findAll();
---
SELECT *
FROM `activity_log`