app/Controllers/UsersData.php

    public function index()
    {
        $find = $this->userDataModel->findAll();
---
SELECT *
FROM `user`