app/Models/ActivityLogModel.php

    public function saveActivityLog($description, $tableName, $activityType)
    {
        $session = session();
        $data = [
            'id_user' => $session->get('user_id'),
            'activity_type' => $activityType,
            'table_name' => $tableName,
            'description' => $description
        ];

        $this->insert($data);
---
INSERT INTO `activity_log` (`id_user`, `activity_type`, `table_name`, `description`) VALUES ('10', 'Update', 'penilaian', 'Penilaian Alternatif ID 12 pada Kriteria ID 8 ditambahkan')