app/Models/AlternativeModel.php

SELECT *
FROM `alternatif`
WHERE `id_alternatif` = '6'
 LIMIT 1
---
    public function getAlternatif($id_alternatif)
    {
        $get = $this->where('id_alternatif', $id_alternatif)
            ->first();