app/Models/AssessmentModel.php

    public function checkDuplicate($periode_penilaian, $id_alternatif, $checkbox, $kriteria_penilaian)
    {
        foreach ($kriteria_penilaian as $id_kriteria => $nilai_kriteria) {
            if (isset($checkbox[$id_kriteria]) && $checkbox[$id_kriteria] == 'on') {
                $query = $this->where('periode_penilaian', $periode_penilaian)
                    ->where('id_alternatif', $id_alternatif)
                    ->where('id_kriteria', $id_kriteria)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `penilaian`
WHERE `periode_penilaian` = '2023'
AND `id_alternatif` = '12'
AND `id_kriteria` = 8

    public function addProcess($data_penilaian)
    {
        $data = $data_penilaian;
        $periode_penilaian = $data['periode_penilaian'];
        $id_alternatif = $data['alternatif_penilaian'];
        $checkbox = $data['checkbox'];
        $kriteria_penilaian = $data['kriteria_penilaian'];
        $ActivityLog = new ActivityLogModel();

        foreach ($kriteria_penilaian as $id_kriteria => $nilai) {
            if (isset($checkbox[$id_kriteria]) && $checkbox[$id_kriteria] == 'on') {
                $data_insert = [
                    'periode_penilaian' => $periode_penilaian,
                    'id_alternatif' => $id_alternatif,
                    'id_kriteria' => $id_kriteria,
                    'nilai' => $nilai
                ];
                $ActivityLog->saveActivityLog("Penilaian Alternatif ID $id_alternatif pada Kriteria ID $id_kriteria ditambahkan", 'penilaian', 'Update');
---
INSERT INTO `penilaian` (`periode_penilaian`, `id_alternatif`, `id_kriteria`, `nilai`) VALUES ('2023', '12', 8, '2')