app/Models/CalculationModel.php

SELECT *
FROM `kriteria`
SELECT MAX(`nilai`) AS `nilai`
FROM `penilaian`
WHERE `id_kriteria` = '8'
---
    public function getMaxValuesByCriteria()
    {
        $maxValues = [];
        $kriteria = $this->db->table('kriteria')->get()->getResultArray();
        foreach ($kriteria as $kriteria_item) {
            $maxValue = $this->db->table('penilaian')
                ->selectMax('nilai')
                ->where('id_kriteria', $kriteria_item['id_kriteria'])
                ->get()
                ->getRow();

SELECT *
FROM `kriteria`
SELECT MIN(`nilai`) AS `nilai`
FROM `penilaian`
WHERE `id_kriteria` = '8'
---
    public function getMinValuesByCriteria()
    {
        $minValues = [];
        $kriteria = $this->db->table('kriteria')->get()->getResultArray();
        foreach ($kriteria as $kriteria_item) {
            $minValue = $this->db->table('penilaian')
                ->selectMin('nilai')
                ->where('id_kriteria', $kriteria_item['id_kriteria'])
                ->get()
                ->getRow();

SELECT *
FROM `kriteria`
---
    public function getBobotKriteria()
    {
        $bobotKriteria = [];
        $kriteria = $this->db->table('kriteria')->get()->getResultArray();