app/Models/CriteriaModel.php

    public function getKriteria($id_kriteria)
    {
        $get = $this->where('id_kriteria', $id_kriteria)->findAll();
---
SELECT *
FROM `kriteria`
WHERE `id_kriteria` = '8'

    public function addProcess($kode_kriteria, $deskripsi_kriteria, $bobot_kriteria)
    {
        $check = $this->where('kode_kriteria', $kode_kriteria)
            ->orWhere('deskripsi_kriteria', $deskripsi_kriteria)
            ->first();

        if ($check) {
            return false;
        }

        $data = [
            'kode_kriteria' => $kode_kriteria,
            'deskripsi_kriteria' => $deskripsi_kriteria,
            'bobot_kriteria' => $bobot_kriteria
        ];

        $this->insert($data);
---
INSERT INTO `kriteria` (`kode_kriteria`, `deskripsi_kriteria`, `bobot_kriteria`) VALUES ('CO5', '1', '2')

    public function editProcess($id_kriteria, $kode_kriteria, $deskripsi_kriteria,  $bobot_kriteria)
    {
        $update = $this->where('id_kriteria', $id_kriteria)
            ->set(['kode_kriteria' => $kode_kriteria, 'deskripsi_kriteria' => $deskripsi_kriteria, 'bobot_kriteria' => $bobot_kriteria])
            ->update();
---
UPDATE `kriteria` SET `kode_kriteria` = 'CO1', `deskripsi_kriteria` = 'Daya Tahan', `bobot_kriteria` = '0.2'
WHERE `id_kriteria` = '8'