app/Models/UserDataModel.php

    public function getUser($id_user)
    {
        $get = $this->where('id_user', $id_user)
            ->first();
---
SELECT *
FROM `user`
WHERE `id_user` = '1'
 LIMIT 1